RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5361/HPM5361_svd.xml
        <register>
          <name>phase_update</name>
          <description>phase_update</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INC</name>
              <description>set to add value to phase_cnt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DEC</name>
              <description>set to minus value from phase_cnt(set inc and dec same time willl act inc)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>value to be added or minus from phase_cnt. only valid when inc or dec is set in one 32bit write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>position</name>
          <description>position</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POSITION</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>position_update</name>
          <description>position_update</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INC</name>
              <description>set to add value to position</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DEC</name>
              <description>set to minus value from position(set inc and dec same time willl act inc)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>value to be added or minus from position. only valid when inc or dec is set in one 32bit write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>angle</name>
          <description>No description available</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANGLE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pos_timeout</name>
          <description>pos_timeout</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0x7FFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>enable position timeout feature, if timeout, send valid again</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>postion timeout value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="QEI0">
      <name>QEI1</name>
      <description>QEI1</description>
      <groupName>QEIV2</groupName>
      <baseAddress>0xf0304000</baseAddress>
    </peripheral>
    <peripheral>
      <name>QEO0</name>
      <description>QEO0</description>
      <groupName>QEO</groupName>
      <baseAddress>0xf0308000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x114</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WAVE_mode</name>
          <description>analog waves mode</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF3</resetMask>
          <fields>
            <field>
              <name>WAVE2_ABOVE_MAX_LIMIT</name>
              <description>wave2 above max limit mode.
0: output 0xffff.
1: output 0x0.
2: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_HIGH_AREA1_LIMIT</name>
              <description>wave2 high area1 limit mode.
0: output 0xffff.
1: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_HIGH_AREA0_LIMIT</name>
              <description>wave2 high area0 limit mode.
0: output 0xffff.
1: output as level_max_limit2.level0_max_limit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_LOW_AREA1_LIMIT</name>
              <description>wave2 low area1 limit mode.
0: output 0.
1: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_LOW_AREA0_LIMIT</name>
              <description>wave2 low area0 limit mode.
0: output 0.
1: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2_BELOW_MIN_LIMIT</name>
              <description>wave2 below min limit mode.
0: output 0.
1: output 0xffff.
2: output as level_min_limit2.level1_min_limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_ABOVE_MAX_LIMIT</name>
              <description>wave1 above max limit mode.
0: output 0xffff.
1: output 0x0.
2: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_HIGH_AREA1_LIMIT</name>
              <description>wave1 high area1 limit mode.
0: output 0xffff.
1: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_HIGH_AREA0_LIMIT</name>
              <description>wave1 high area0 limit mode.
0: output 0xffff.
1: output as level_max_limit1.level0_max_limit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_LOW_AREA1_LIMIT</name>
              <description>wave1 low area1 limit mode.
0: output 0.
1: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_LOW_AREA0_LIMIT</name>
              <description>wave1 low area0 limit mode.
0: output 0.
1: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1_BELOW_MIN_LIMIT</name>
              <description>wave1 below min limit mode.
0: output 0.
1: output 0xffff.
2: output as level_min_limit1.level1_min_limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_ABOVE_MAX_LIMIT</name>
              <description>wave0 above max limit mode.
0: output 0xffff.
1: output 0x0.
2: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_HIGH_AREA1_LIMIT</name>
              <description>wave0 high area1 limit mode.
0: output 0xffff.
1: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_HIGH_AREA0_LIMIT</name>
              <description>wave0 high area0 limit mode.
0: output 0xffff.
1: output as level_max_limit0.level0_max_limit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_LOW_AREA1_LIMIT</name>
              <description>wave0 low area1 limit mode.
0: output 0.
1: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_LOW_AREA0_LIMIT</name>
              <description>wave0 low area0 limit mode.
0: output 0.
1: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE0_BELOW_MIN_LIMIT</name>
              <description>wave0 below min limit mode.
0: output 0.
1: output 0xffff.
2: output as level_min_limit0.level1_min_limit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDLE_TYPE</name>
              <description>saddle type seclect;
0:standard saddle.
1: triple-cos saddle.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WAVE2_VD_VQ_INJECT</name>
              <description>wave2 VdVq inject enable.
0: disable VdVq inject.
1: enable VdVq inject.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WAVE1_VD_VQ_INJECT</name>
              <description>wave1 VdVq inject enable.
0: disable VdVq inject.
1: enable VdVq inject.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_WAVE0_VD_VQ_INJECT</name>
              <description>wave0 VdVq inject enable.
0: disable VdVq inject.
1: enable VdVq inject.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVES_OUTPUT_TYPE</name>
              <description>wave0/1/2 output mode.
0: cosine wave.
1: saddle wave.
2. abs cosine wave.
3. saw wave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_resolution</name>
          <description>resolution of wave0/1/2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINES</name>
              <description>wave0/1/2 resolution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_PHASE_SHIFT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^16) period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_VD_VQ_INJECT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VQ_VAL</name>
              <description>Vq inject value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VD_VAL</name>
              <description>Vd inject value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE_vd_vq_load</name>
          <description>load wave0/1/2 vd vq value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>load wave0/1/2 vd vq value.  always read 0
0: vd vq keep previous value.
1: load wave0/1/2 vd vq value at sametime.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_AMPLITUDE[%s]</name>
          <description>no description available</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>EN_SCAL</name>
              <description>enable wave amplitude scaling. 0: disable; 1: enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_VAL</name>
              <description>amplitude scaling value. bit15-12 are integer part value. bit11-0 are fraction value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_MID_POINT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 output middle point, use this value as 32 bit signed value. bit 31 is signed bit. bit30-27 is integer part value. bit26-0 is fraction value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_LIMIT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x3c</addressOffset>
          <register>
            <name>min</name>
            <description>wave0 low area limit value</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT1</name>
                <description>low area limit level1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LIMIT0</name>
                <description>low area limit level0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>max</name>
            <description>wave0 high area limit value</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LIMIT1</name>
                <description>high area limit level1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LIMIT0</name>
                <description>high area limit level0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>wave0,wave1,wave2</dimIndex>
          <name>WAVE_DEADZONE_SHIFT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>wave0 deadzone shifter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
