RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5361/HPM5361_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="QEO0">
      <name>QEO1</name>
      <description>QEO1</description>
      <groupName>QEO</groupName>
      <baseAddress>0xf030c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MMC0</name>
      <description>MMC0</description>
      <groupName>MMC</groupName>
      <baseAddress>0xf0310000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x334</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SFTRST</name>
              <description>Software reset, high active. When write 1 ,all internal logical will be reset.
0b - No action
1b - All MMC internal registers are forced into their reset state. Interface registers are not affected.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_BR0_POS_REQ</name>
              <description>Auto clear. Only effective in open_loop mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_BR1_POS_REQ</name>
              <description>Auto clear. Only effective in open_loop mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCACCELZERO</name>
              <description>Zeroise the accelerator calculation.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS_COEF_EN</name>
              <description>Multiple Coefficients Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_DELTA_POS_TRG_TYPE</name>
              <description>0: Time Stamp in the configuration
1: Risedge of In Trg[0]
2: Risedge of In Trg[1]
3: Risedge of out trg[0]
4: Risedge of out trg[1]
5: triggered by self position trigger
6: triggered by self speed trigger
Otherser: no function</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_POS_TRG_TYPE</name>
              <description>0: Time Stamp in the configuration
1: Risedge of In Trg[0]
2: Risedge of In Trg[1]
3: Risedge of out trg[0]
4: Risedge of out trg[1]
5: triggered by self position trigger
6: triggered by self speed trigger
Otherser: no function</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_DELTA_POS_CMD_MSK</name>
              <description>1: change
0: won't change
bit 3: for delta accel
bit 2: for delta speed
bit 1: for delta revolution
bit 0: for delta position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_DELTA_POS_REQ</name>
              <description>1: Command to reload the delta pos. Auto clear
0:</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPEN_LOOP_MODE</name>
              <description>1: in open loop mode
0: not in open loop mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POS_TYPE</name>
              <description>1: 32-bit for rev+pos, with each element occupying 16 bits
0: 32-bit for rev, and 32 bit for pos
When CR[MANUAL_IO]==1,
1: means that the INI_POS is acting as INI_POS cmds
0: means that the INI_POS is simulating the input of iposition and itimestamp</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_POS_CMD_MSK</name>
              <description>1: change
0: won't change
bit 3: for accel
bit 2: for speed
bit 1: for revolution
bit 0: for position</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_POS_REQ</name>
              <description>1: Command to reload the positions. Auto clear
0:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_COEFS_CMD_MSK</name>
              <description>1: change
0: won't change
bit 2: for ACOEF
bit 1: for ICOEF
bit 0: for PCOEF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_COEFS_CMD</name>
              <description>1: Command to reload the coefs. Auto clear
0:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHADOW_RD_REQ</name>
              <description>1: Shadow Request for read of tracking parameters. Auto clear
0:</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADJOP</name>
              <description>1: use the input iposition whenever a new iposition comes, and force the predicted output stop at the boundaries.
0: Continuous tracking mode, without any boundary check</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCRETETRC</name>
              <description>1: Discrete position input
0: Continuous position input</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_EN</name>
              <description>Module Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STA</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xF00007F7</resetMask>
          <fields>
            <field>
              <name>ERR_ID</name>
              <description>Tracking ERR_ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEED_TRG_VALID</name>
              <description>W1C</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POS_TRG_VALID</name>
              <description>W1C</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INI_DELTA_POS_REQ_CMD_DONE</name>
              <description>W1C</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INI_BR0_POS_REQ_CMD_DONE</name>
              <description>W1C</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INI_BR1_POS_REQ_CMD_DONE</name>
              <description>W1C</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>Tracking Module in Idle status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OOSYNC</name>
              <description>Tracking module out-of sync. W1C</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INI_POS_REQ_CMD_DONE</name>
              <description>W1C</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INI_COEFS_CMD_DONE</name>
              <description>W1C</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHADOW_RD_DONE</name>
              <description>Shadow ready for read. Auto cleared by setting CR[SHADOW_RD_REQ] as 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007D7</resetMask>
          <fields>
            <field>
              <name>SPEED_TRG_VLD_IE</name>
              <description>Interrupt Enable for SPEED_TRG_VALID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POS_TRG_VLD_IE</name>
              <description>Interrupt Enable for POS_TRG_VALID</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_DELTA_POS_REQ_CMD_DONE_IE</name>
              <description>Interrupt Enable for INI_DELTA_POS_REQ_CMD_DONE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_BR0_POS_REQ_CMD_DONE_IE</name>
              <description>Interrupt Enable for INI_BR0_POS_REQ_CMD_DONE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_BR1_POS_REQ_CMD_DONE_IE</name>
              <description>Interrupt Enable for INI_BR1_POS_REQ_CMD_DONE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOSYNC_IE</name>
              <description>Interrupt Enable for OOSYNC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_POS_REQ_CMD_DONE_IE</name>
              <description>Interrupt Enable for INI_POS_REQ_CMD_DONE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INI_COEFS_CMD_DONE_IE</name>
              <description>Interrupt Enable for INI_COEFS_CMD_DONE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHADOW_RD_DONE_IE</name>
              <description>Interrupt Enable for SHADOW_RD_DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_FREQ</name>
          <description>System Clock Frequency Register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>system clock frequency, ufix&lt;32, 0&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLK_PERIOD</name>
          <description>System Clock Period Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>round( the value of clock period * (2^24)*(2^20) ), ufix&lt;32, 0&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OOSYNC_THETA_THR</name>
          <description>Position Out-Of-Sync Threshold Regster</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the threshold of theta difference between actual and prediction for out-of-sync determination，ufix&lt;32, 32&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DiscreteCfg0</name>
          <description>Discrete Mode Configuration 0 Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>POSMAX</name>
              <description>Max ID Of Lines. For example-1, for 512 lines, it is 511. ufix&lt;32, 0&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DiscreteCfg1</name>
          <description>Discrete Mode Configuration 1 Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INV_POSMAX</name>
              <description>discrete mode: ufix&lt;32, 0&gt; of 1/(Number Of Lines)
continuous mode: the max delta for tracking from the last received position, ufix&lt;32, 32&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ContCfg0</name>
          <description>Continuous Mode Configuration 0 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HALF_CIRC_THETA</name>
              <description>the theta for cal the clockwise or anticlockwise rotation between two adjacent inputs, ufix&lt;32, 32&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_POS_TIME</name>
          <description>The destined timestamp register for position initialization</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>indicate the time to change the values.
0: instant change</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_POS</name>
          <description>The destined position register for position initialization</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value；
continuous mode: ufix&lt;32, 32&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_REV</name>
          <description>The destined revolution register for position initialization</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value；
continuous mode: ufix&lt;32, 0&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_SPEED</name>
          <description>The destined speed register for position initialization</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value;
continuous mode: fix&lt;32, 19&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_ACCEL</name>
          <description>The destined accelerator register for position initialization</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value
continuous mode: fix&lt;32, 19&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_COEF_TIME</name>
          <description>The destined timestamp register for coefficients initialization</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>indicate the time to change the values.
0: instant change</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_PCOEF</name>
          <description>The destined coefficient P register for coefficients initialization</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value, fix&lt;32, 15&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_ICOEF</name>
          <description>The destined coefficient I register for coefficients initialization</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value, fix&lt;32, 21&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INI_ACOEF</name>
          <description>The destined coefficient A register for coefficients initialization</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value, fix&lt;32, 19&gt;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTM_TIM</name>
          <description>The timestamp register for internal estimation</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VAL</name>
              <description>the value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
