RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5361/HPM5361_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="DAC0">
      <name>DAC1</name>
      <description>DAC1</description>
      <groupName>DAC</groupName>
      <baseAddress>0xf3094000</baseAddress>
    </peripheral>
    <peripheral>
      <name>OPAMP0</name>
      <description>OPAMP0</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0xf30a0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ctrl0</name>
          <description>control reg</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0407FFFF</resetMask>
          <fields>
            <field>
              <name>EN_LV</name>
              <description>No description available</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIM_SEL</name>
              <description>No description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>No description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN_SEL</name>
              <description>No description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_PM_CAP</name>
              <description>No description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MILLER_SEL</name>
              <description>No description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBYPASS</name>
              <description>No description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIP_SEL</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>status</name>
          <description>status reg</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0000</resetMask>
          <fields>
            <field>
              <name>TRIG_CONFLICT</name>
              <description>if more than one hardware trigger is set, will put all trigger input here;
write any value to clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESET_ACT</name>
              <description>1 for preset active; one of cur_preset is selected for OPAMP;
0 for no preset, OPAMP use cfg0 parameters</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_PRESET</name>
              <description>current selected preset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ctrl1</name>
          <description>control reg1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000007</resetMask>
          <fields>
            <field>
              <name>SW_PRESET</name>
              <description>set to use preset defined by sw_sel.
NOTE: when set, the hardware trigger will not be used</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_SEL</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>preset0,preset1,preset2,preset3,preset4,preset5,preset6,preset7</dimIndex>
          <name>CFG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>cfg0</name>
            <description>No description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0F000707</resetMask>
            <fields>
              <field>
                <name>DISABLE_PM_CAP</name>
                <description>No description available</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MILLER_SEL</name>
                <description>No description available</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VIM_SEL</name>
                <description>No description available</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VIP_SEL</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>No description available</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE00000FF</resetMask>
            <fields>
              <field>
                <name>HW_TRIG_EN</name>
                <description>set to enable hardware trigger from moto system.
NOTE: when sw_preset is enabled, this bit will not take effert</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_LV</name>
                <description>No description available</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VBYPASS_LV</name>
                <description>No description available</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MODE</name>
                <description>No description available</description>
                <bitOffset>3</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>GAIN_SEL</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg2</name>
            <description>No description available</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x07000000</resetMask>
            <fields>
              <field>
                <name>CHANNEL</name>
                <description>No description available</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
